import {
  StyledTermContentTitle,
  StyledTermParagraph,
  StyledTermSectionHeading,
} from './TermContent.style';

export const ServiceTerm = () => {
  return (
    <div>
      <StyledTermContentTitle>[숨쉴때 서비스 이용약관]</StyledTermContentTitle>
      <StyledTermSectionHeading>제1조(목적)</StyledTermSectionHeading>
      <StyledTermParagraph>
        이 약관은 숭실대학교 중앙동아리 YOURSSU(이하 “유어슈”)가 제공하는 숨쉴때 서비스를 이용하는
        데 있어 유어슈와 이용자 간의 권리와 의무 및 책임사항 등을 규정함을 목적으로 합니다.
      </StyledTermParagraph>
      <StyledTermSectionHeading>제2조(정의)</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 이 약관에서 사용하는 정의는 다음과 같습니다. 1. “유어슈”는 숨쉴때 서비스를 제공하고
        관리하는 자를 말합니다. 2. “서비스”는 “유어슈”가 제공하는 숨쉴때 및 관련 제반 서비스를
        말합니다. 3. “회원”은 이 약관에 동의하고 회원가입을 하여 “서비스”를 이용하는 자를 말합니다.
        4. “비회원”은 회원가입을 하지 않고 “서비스”를 이용하는 자를 말합니다. 5. “이용자”는
        “서비스”를 이용하는 자를 말하며, “회원”과 “비회원”을 모두 포함합니다. 6. “계정 정보”란
        “서비스”를 이용하기 위해 “유어슈”가 정한 필수 입력 정보로서 “회원”이 회원가입 시 기입한
        이메일, 비밀번호, 닉네임을 통칭합니다. ② 이 약관에서 사용하는 용어 중 본조에서 정하지 아니한
        것은 관계법령에서 정하는 바에 따르며, 그 외에는 일반 상관례를 따릅니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제3조 약관의 명시 및 개정</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈는 이용자가 이 약관의 내용을 확인할 수 있도록 서비스 초기 회원가입 화면과
        마이페이지에 게시합니다. ② 유어슈는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 이
        약관을 개정할 수 있습니다. 약관이 개정되는 경우에 개정된 약관의 내용과 시행일을 정하여
        최소한 그 약관이 적용되기 7일 이전부터 서비스 내에 게시하여 이용자에게 공지합니다. ③ 회원은
        개정된 약관에 동의하지 않을 권리가 있으며 동의하지 않을 경우에는 서비스 이용을 중단하고
        탈퇴할 수 있습니다. 다만, 전항과 같이 개정된 약관 공지 후 시행일까지 동의하지 않는다는
        명시적인 의사표시를 하지 아니하면 개정된 약관에 동의한 것으로 간주합니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제4조 약관 외 준칙</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「정보통신망 이용촉진 및
        정보보호 등에 관한 법률」, 「개인정보 보호법」, 「약관의 규제에 관한 법률」 등 관계법령 또는
        상관례에 따릅니다. ② 유어슈는 이용자의 서비스 내 모바일 커뮤니티 이용을 위하여 세부지침으로
        ‘커뮤니티 이용규칙’을 정하여 운영하며, 해당 내용은 서비스 초기 회원가입 화면과 마이페이지에
        게시합니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제5조 회원가입</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 회원가입은 이용자가 이 약관의 내용에 대하여 동의를 하고 회원가입신청을 한 후 유어슈가
        이러한 신청에 대하여 승낙함으로써 완료됩니다. ② 유어슈는 상기 이용자의 회원가입신청에 대하여
        승낙함을 원칙으로 합니다. 다만, 유어슈는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지
        않을 수 있습니다. 1. 회원가입신청 시 허위 내용 기재, 오기, 필수 정보 기재 누락, 타인의
        명의를 도용한 경우 2. 서비스에 이미 회원가입된 이메일을 기재한 경우 3. 이용자의 귀책사유로
        인하여 승인이 불가능한 경우 ③ 유어슈는 관련 설비의 여유가 없거나, 기술상 또는 업무상 장애가
        있는 경우 또는 그 밖의 이에 준하는 사유로서 회원가입신청의 승낙이 어렵다고 판단되는 경우
        신청에 대한 승낙을 제한할 수 있고, 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다. ④ 본조
        제2항과 제3항에 따라 유어슈는 회원가입신청의 승낙을 하지 아니하거나 유보한 경우 이용자에게
        알리는 것을 원칙으로 합니다. 다만, 유어슈의 귀책사유 없이 이용자에게 통지할 수 없는 경우에는
        예외로 합니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제6조 회원탈퇴 및 자격 상실</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 회원은 서비스 내 계정 탈퇴를 통해 유어슈에 탈퇴를 요청할 수 있으며 유어슈는 회원탈퇴를
        처리합니다. 회원탈퇴로 인해 회원의 계정 정보는 모두 삭제되어 복구할 수 없게 됩니다. ②
        회원탈퇴가 이루어진 경우에도 탈퇴한 회원이 모바일 커뮤니티에 작성한 글이나 댓글을 비롯하여
        서랍장 기능상에 해당 회원이 게시한 본인의 서비스(My Products), 이미지, 문구 및 닉네임은
        삭제되지 않으므로 탈퇴 전에 반드시 삭제 후 탈퇴하시기를 바랍니다. ③ 회원이 다음 각 호의
        사유에 해당하는 경우, 유어슈는 회원자격을 상실시킬 수 있습니다. 1. 타인에게 혐오감을 주거나
        원활한 서비스 제공에 반하는 닉네임인 경우 2. 회원가입신청 시 허위 정보를 기재하여 회원가입이
        이루어진 경우 3. 다른 사람의 명의나 이메일 등 개인정보를 이용하여 계정을 생성한 경우 ④
        유어슈가 회원자격을 상실시키는 경우에는 회원등록을 말소하며, 이 경우 회원에게 이를 통지하고,
        회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다. 다만, 유어슈의
        귀책사유 없이 이용자에게 통지할 수 없는 경우에는 예외로 합니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제7조 회원에 대한 통지</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈가 회원에 대한 통지를 하는 경우 계정 정보를 기준으로 하여 회원이 지정한 이메일로 할
        수 있습니다. ② 유어슈는 회원 또는 이용자 전체에 대한 통지를 하는 경우 7일 이상 서비스 내에
        게시하거나 팝업 창을 제시함으로써 전항의 통지에 갈음할 수 있습니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제8조 유어슈의 의무</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈는 관계법령을 준수하고, 이 약관에서 정하는 권리의 행사 및 의무의 이행을 신의에 따라
        성실하게 합니다. ② 유어슈는 이용자가 안전하게 서비스를 이용할 수 있도록 개인정보 보호를 위해
        개인정보 처리방침을 공시하고 준수해야 합니다. ③ 이용자는 서비스를 이용하는 데 있어 발생하는
        불편 및 권리 침해 사항을 유어슈 공식 이메일(yourssu.com@gmail.com)로 신고할 수 있고 유어슈는
        이를 처리하기 위해 노력합니다. 이때 유어슈는 이용자의 신고에 대해서 그 처리 결과를 제7조
        제1항에 따라 통지합니다. 처리에 장기간이 소요되는 경우에는 그 지연사유와 처리 일정을
        이용자에게 통지합니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제9조 회원 및 이용자의 의무</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 이용자는 이 약관 및 관계법령을 준수하여야 하며, 기타 유어슈의 업무에 방해되는 행위를
        하여서는 안 됩니다. ② 이용자는 유어슈가 제공하는 서비스를 이용함에 있어 다음과 같은 행위를
        하거나 의도하는 행위를 하여서는 안 됩니다. 1. 회원가입 시 허위사실을 기재하는 행위 2.
        유어슈로 사칭하거나 타인의 명의를 도용하여 글을 작성하거나 메일을 발송하는 행위, 타인으로
        사칭하거나 타인과의 관계를 허위로 명시하는 행위 3. 타인의 개인정보를 무단으로 수집, 저장,
        게시 또는 유포하는 행위 4. 도박 등의 사행행위를 하거나 유도하는 행위, 음란ㆍ저속한 정보를
        교류ㆍ게재하거나 음란 사이트를 연결(링크)하는 행위, 수치심ㆍ 혐오감 또는 공포심을 일으키는
        글ㆍ그림ㆍ사진을 게시 또는 유포하는 행위 등 서비스를 불건전하게 이용하는 행위 5. 서비스를
        이용해 취득한 정보를 임의 가공, 판매하는 등 서비스에 게시된 정보를 상업적으로 사용하는 행위
        6. 타인을 기망하여 이득을 취하는 행위, 서비스 이용과 관련하여 타인에게 피해를 주는 행위 7.
        유어슈나 타인의 지식재산권 또는 초상권을 침해하는 행위, 타인의 명예를 훼손하는 등 손해를
        가하는 행위 8. 법령에 의하여 전송 또는 게시가 금지된 정보(컴퓨터 프로그램)나 컴퓨터
        소프트웨어, 하드웨어 또는 전기통신장비의 정상적인 작동을 방해ㆍ파괴할 목적으로 고안된
        바이러스, 컴퓨터 코드, 파일, 프로그램 등을 고의로 게시ㆍ유포 또는 사용하는 행위 9.
        유어슈로부터 특별한 권리를 부여받지 않고 서비스를 변경하거나, 서비스에 다른 프로그램을
        추가ㆍ삽입하거나, 서버를 해킹ㆍ역설계하거나, 별도의 서버를 구축하거나, 서비스의 일부분을
        임의로 변경ㆍ도용하여 유어슈를 사칭하는 행위 10. 그 밖에 관계법령에 위반되거나 선량한 풍속
        기타 사회통념에 반하는 행위 ③ 회원의 계정 관리 책임은 회원에게 있으며, 이를 타인이
        이용하도록 하게 하여서는 안 됩니다. 타인에게 본인의 계정 이용을 승낙함으로 인해 발생하는
        손해에 대해서 유어슈는 어떠한 책임도 지지 않습니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제10조 서비스의 이용</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈는 모든 이용자가 서비스를 이용할 수 있도록 합니다. 단, 비회원은 제5조에 따라
        회원가입을 완료한 후에 서랍장 기능상에 회원 본인의 서비스(My Products)를 게시할 수 있으며,
        모바일에서 커뮤니티에 글이나 댓글을 작성하거나 성적표 기능을 이용할 수 있습니다. ② 성적표
        기능의 경우 회원가입 후 추가로 유세인트 로그인을 완료한 뒤에 이용이 가능합니다. ③ 서랍장
        기능의 경우 회원이 서랍장 기능상에 게시한 본인의 서비스(My Products)를 삭제하면 복구할 수
        없게 됩니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제11조 서비스 이용제한 및 종료</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 회원은 제6조 제3항에서 정한 행위를 하거나 제9조에 따른 의무를 위반하는 행위를 하여서는 안
        되며, 해당 행위를 하는 경우에 유어슈는 회원자격을 상실시키거나 이용제한 조치를 할 수
        있습니다. 유어슈가 이러한 조치를 하는 경우에는 회원에게 이메일로 사전 통지합니다. 다만,
        긴급히 조치할 필요가 있는 경우에는 사후에 통지할 수 있습니다. ② 이용자는 유어슈의 이용제한
        조치에 불복하고자 할 때 유어슈 공식 이메일(yourssu.com@gmail.com)로 불복 이유를 제출할 수
        있습니다. 불복 이유가 타당한 경우에는 유어슈는 이에 따른 조치를 취합니다. ③ 유어슈는 시스템
        점검 등 운영상 필요한 경우 서비스를 일시 중단할 수 있습니다. 이 경우 유어슈는 서비스 내에
        사전 공지하거나 혹은 부득이한 사정이 있는 경우에는 사후에 공지할 수 있습니다. ④ 서비스가
        종료되는 경우 이용이 제한됩니다. 이 경우 이용자에게 종료 일자와 종료 사유를 최소한 그 종료일
        30일 이전부터 서비스 내에 공지합니다. 서비스 종료 시 회원의 계정 정보와 서비스상에 작성된
        글을 비롯한 모든 정보는 파기됩니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제12조 개인정보보호</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈는 관계법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력해야 하며,
        개인정보의 보호 및 이용에 대해서는 숨쉴때 서비스 개인정보 처리방침에 따릅니다. ② 유어슈가
        제공하는 서비스 이외의 링크된 서비스에서는 숨쉴때 서비스 개인정보 처리방침이 적용되지
        않습니다. 링크된 서비스에서의 개인정보 취급과 관련하여서는 해당 사이트의 개인정보 처리방침을
        확인할 책임이 이용자에게 있으며, 유어슈는 이에 대하여 책임을 부담하지 않습니다. ③ 유어슈는
        이용자의 귀책사유로 개인정보가 유출되어 발생한 피해에 대하여 책임을 부담하지 않습니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제13조 저작권 보호 등</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈가 작성 또는 제작한 저작물에 대한 저작권은 유어슈에 귀속됩니다. ② 유어슈는 서랍장
        기능 운영을 위해 회원에게 본인이 게시한 이미지가 서비스를 통해 공중송신되는 것에 대한 동의를
        받아 이용합니다. ③ 회원이 모바일 커뮤니티에 작성한 글이나 댓글을 비롯하여 서랍장 기능상에
        게시한 회원 본인의 서비스(My Products), 이미지, 문구 등에 대한 권리는 해당 회원에게 귀속되며
        이로 인해 발생하는 문제에 대한 책임은 회원 본인이 부담하게 됩니다. ④ 권리를 침해받은
        권리자는 그 침해 사실을 소명해 유어슈에 신고할 수 있으며 유어슈는 신고 대응 절차 및
        관계법령에 따라 신고를 처리합니다. 이때 유어슈는 권리 침해자에게 이미지 교체 등의 의무 이행
        내용을 이메일로 통지할 수 있습니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제14조 손해배상</StyledTermSectionHeading>
      <StyledTermParagraph>
        유어슈 또는 이용자는 이 약관을 위반하여 상대방에게 손해를 입힌 경우에는 그 손해를 배상할
        책임이 있습니다. 다만, 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제15조 면책</StyledTermSectionHeading>
      <StyledTermParagraph>
        ① 유어슈는 이용자가 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는
        책임을 지지 않습니다. ② 유어슈는 이용자가 다른 이용자 또는 제3자와 서비스를 매개로 발생한
        거래나 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해에 대해 책임을 지지 않습니다. ③
        유어슈는 이용자가 서비스를 이용하여 기대하는 이익을 얻지 못하거나 상실한 것에 대하여 책임을
        지지 않습니다. ④ 유어슈는 이용자 또는 제3자가 서비스를 이용하여 불법적으로 전송, 유포하거나
        또는 전송, 유포되도록 한 모든 바이러스, 스파이웨어 및 기타 악성 프로그램으로 인한 손해에
        대하여 책임을 지지 않습니다.
      </StyledTermParagraph>

      <StyledTermSectionHeading>제16조 분쟁의 해결</StyledTermSectionHeading>
      <StyledTermParagraph>
        유어슈와 이용자는 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든
        노력을 하여야 합니다. 그럼에도 불구하고 분쟁이 해결되지 않으면 민사소송법상의 관할법원에
        소를 제기할 수 있습니다.
      </StyledTermParagraph>

      <StyledTermParagraph>본 약관은 2024년 2월 27일부터 시행됩니다.</StyledTermParagraph>
    </div>
  );
};
